jimmywong2003/nrf52840-dongle-example/sdk_mod/ble_services/ble_image_transfer_service/ble_image_transfer_service.c
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

        cccd_md.vloc = BLE_GATTS_VLOC_STACK;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.notify = 1;
        char_md.p_char_user_desc = NULL;
        char_md.p_char_pf = NULL;
        char_md.p_user_desc_md = NULL;
        char_md.p_cccd_md = &cccd_md;
        char_md.p_sccd_md = NULL;

        ble_uuid.type = p_its->uuid_type;
        ble_uuid.uuid = BLE_UUID_ITS_TX_CHARACTERISTIC;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 0;
        attr_md.vlen = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len = sizeof(uint8_t);
        attr_char_value.init_offs = 0;
        attr_char_value.max_len = BLE_ITS_MAX_TX_CHAR_LEN;

        return sd_ble_gatts_characteristic_add(p_its->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_its->tx_handles);
        /**@snippet [Adding proprietary characteristic to S110 SoftDevice] */
}

/**@brief Function for adding TX characteristic.
 *
 * @param[in] p_its       Nordic UART Service structure.
 * @param[in] p_its_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t img_info_char_add(ble_its_t *p_its, const ble_its_init_t *p_its_init)
{
        /**@snippet [Adding proprietary characteristic to S110 SoftDevice] */
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_md_t cccd_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&cccd_md, 0, sizeof(cccd_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);

        cccd_md.vloc = BLE_GATTS_VLOC_STACK;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.notify = 1;
        char_md.p_char_user_desc = NULL;
        char_md.p_char_pf = NULL;
        char_md.p_user_desc_md = NULL;
        char_md.p_cccd_md = &cccd_md;
        char_md.p_sccd_md = NULL;

        ble_uuid.type = p_its->uuid_type;
        ble_uuid.uuid = BLE_UUID_ITS_IMG_INFO_CHARACTERISTIC;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 0;
        attr_md.vlen = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len = 1 + sizeof(ble_its_img_info_t);
        attr_char_value.init_offs = 0;
        attr_char_value.max_len = 16;

        return sd_ble_gatts_characteristic_add(p_its->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_its->img_info_handles);
        /**@snippet [Adding proprietary characteristic to S110 SoftDevice] */
}

/**@brief Function for adding RX characteristic.
 *
 * @param[in] p_its       Nordic UART Service structure.
 * @param[in] p_its_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t rx_char_add(ble_its_t *p_its, const ble_its_init_t *p_its_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.write = 1;
        char_md.char_props.write_wo_resp = 1;
        char_md.p_char_user_desc = NULL;
        char_md.p_char_pf = NULL;
        char_md.p_user_desc_md = NULL;
        char_md.p_cccd_md = NULL;
        char_md.p_sccd_md = NULL;

        ble_uuid.type = p_its->uuid_type;
        ble_uuid.uuid = BLE_UUID_ITS_RX_CHARACTERISTIC;

        memset(&attr_md, 0, sizeof(attr_md));

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);

        attr_md.vloc = BLE_GATTS_VLOC_STACK;
        attr_md.rd_auth = 0;
        attr_md.wr_auth = 0;
        attr_md.vlen = 1;

        memset(&attr_char_value, 0, sizeof(attr_char_value));

        attr_char_value.p_uuid = &ble_uuid;
        attr_char_value.p_attr_md = &attr_md;
        attr_char_value.init_len = 1;
        attr_char_value.init_offs = 0;
        attr_char_value.max_len = BLE_ITS_MAX_RX_CHAR_LEN;

        return sd_ble_gatts_characteristic_add(p_its->service_handle,
                                               &char_md,
                                               &attr_char_value,
                                               &p_its->rx_handles);
}

/**@brief Function for adding RX characteristic.
 *
 * @param[in] p_its       Nordic UART Service structure.
 * @param[in] p_its_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t rx_data_char_add(ble_its_t *p_its, const ble_its_init_t *p_its_init)
{
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&char_md, 0, sizeof(char_md));

        char_md.char_props.write = 1;
        char_md.char_props.write_wo_resp = 1;
        char_md.p_char_user_desc = NULL;
        char_md.p_char_pf = NULL;
        char_md.p_user_desc_md = NULL;
        char_md.p_cccd_md = NULL;
        char_md.p_sccd_md = NULL;

