jimmywong2003/nrf52840-dongle-example/sdk_mod/ble_services/ble_image_transfer_service/ble_image_transfer_service.c
uint32_t ble_its_ble_params_info_send(ble_its_t *p_its, ble_its_ble_params_info_t *ble_params_info)
{
        uint8_t data_buf[1 + sizeof(ble_its_ble_params_info_t)];
        ble_gatts_hvx_params_t hvx_params;

        VERIFY_PARAM_NOT_NULL(p_its);

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_info_char_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        uint16_t length = 1 + sizeof(ble_its_ble_params_info_t);

        data_buf[0] = 2;
        memcpy(&data_buf[1], ble_params_info, sizeof(ble_its_ble_params_info_t));

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_its->img_info_handles.value_handle;
        hvx_params.p_data = data_buf;
        hvx_params.p_len = &length;
        hvx_params.type = BLE_GATT_HVX_NOTIFICATION;

        return sd_ble_gatts_hvx(p_its->conn_handle, &hvx_params);
}

uint32_t ble_its_img_info_send(ble_its_t *p_its, ble_its_img_info_t *img_info)
{
        uint8_t data_buf[1 + sizeof(ble_its_img_info_t)];
        ble_gatts_hvx_params_t hvx_params;

        VERIFY_PARAM_NOT_NULL(p_its);

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_info_char_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        uint16_t length = 1 + sizeof(ble_its_img_info_t);

        data_buf[0] = 1;
        memcpy(&data_buf[1], img_info, sizeof(ble_its_img_info_t));

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_its->img_info_handles.value_handle;
        hvx_params.p_data = data_buf;
        hvx_params.p_len = &length;
        hvx_params.type = BLE_GATT_HVX_NOTIFICATION;

        return sd_ble_gatts_hvx(p_its->conn_handle, &hvx_params);
}

uint32_t ble_its_send_file(ble_its_t *p_its, uint8_t *p_data, uint32_t data_length, uint32_t max_packet_length)
{
        uint32_t err_code;

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        if (file_size != 0)
        {
                return NRF_ERROR_BUSY;
        }

        ble_its_img_info_t image_info;
        image_info.file_size_bytes = data_length;
        ble_its_img_info_send(p_its, &image_info);

        file_size = data_length;
        file_pos = 0;
        file_data = p_data;
        m_max_data_length = max_packet_length;
        m_its = p_its;

        err_code = push_data_packets();
        if (err_code == NRF_ERROR_RESOURCES)
                return NRF_SUCCESS;
        return err_code;
}

uint32_t ble_its_send_file_fragment(ble_its_t *p_its, uint8_t *p_data, uint32_t data_length)
{
        uint32_t err_code;

        if ((p_its->conn_handle == BLE_CONN_HANDLE_INVALID) || (!p_its->is_notification_enabled))
        {
                return NRF_ERROR_INVALID_STATE;
        }

        if (file_size != 0)
        {
                return NRF_ERROR_BUSY;
        }

        err_code = ble_its_string_send(p_its, p_data, data_length);
        return err_code;
}

bool ble_its_file_transfer_busy(void)
{
        return file_size != 0;
}

#endif // NRF_MODULE_ENABLED(BLE_NUS)
